IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
      
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT STUDENT ASSIGN TO 'en_full.txt'
      ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
   FILE SECTION.
   FD STUDENT.
   01 STUDENT-FILE.
      05 NAME PIC A(25).
      05 STUDENT-ID PIC 9(5).

   WORKING-STORAGE SECTION.
   01 WS-C PIC 9(9).
   01 WS-PL PIC 9(9).
   01 WS-STUDENT.
      05 WS-NAME PIC A(25).
      05 WS-STUDENT-ID PIC 9(5).
   01 WS-EOF PIC A(1). 

PROCEDURE DIVISION.
   OPEN INPUT STUDENT.


      PERFORM UNTIL WS-EOF='Y'
         READ STUDENT INTO WS-STUDENT
	    
            AT END MOVE 'Y' TO WS-EOF
            
            NOT AT END DISPLAY WS-STUDENT
            ADD 1 TO WS-C
         END-READ   
      END-PERFORM.
      
   CLOSE STUDENT.
    DISPLAY 'ENGLISH WORDS: ' WS-C.
STOP RUN.
